W4D1/FirstRoutes/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 43]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1  [["id", 42]]
---
  def index
    if params[:user_id]
      @contacts = Contact.where(user_id: params[:user_id])
    else
      @contacts = Contact.all